#### LinkConversionData Members

---

|  |
| --- |
| LinkConversionData Class   Methods   Properties   See Also |

The  LinkConversionData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  LinkConversionData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetOptions | Extra information used during the creation of the Revit document. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Path | The path to the source data used to generate the model. |
| Public property | ServerId | The service responsible for converting the data into a Revit file. |

# See Also

LinkConversionData Class

Autodesk.Revit.DB Namespace